Feature: Визуализиране на аутфити

  Background: отваряне на приложението
    Given отваряне на приложението

  Scenario: Отваряне на начален екран с налични аутфити
    Then Визуализира се списък с наличните аутфити

  Scenario: Отваряне на начален екран с налични аутфити с търсене по ключова дума
    When потребителя въвежда ключова дума "черна рокля" в полето за търсене
    And натиска бутона за търсене
    Then Визуализира се списък с наличните аутфити

  Scenario: Отваряне на начален екран с налични аутфити с търсене по ключова дума
    When потребителя въвежда ключова дума "тфъдкафэд" в полето за търсене
    And натиска бутона за търсене
    Then Неуспешно търсене

  Scenario: Отваряне на начален екран с налични аутфити с търсене по ключова дума
    When потребителя въвежда ключова дума "...../:*%:/!€" в полето за търсене
    And натиска бутона за търсене
    Then Вижда съобщение "Не може да използвате знаци при търсене"

  Scenario: Отваряне на начален екран с налични аутфити с търсене по ключова дума
    When потребителя въвежда ключова дума "Имало едно време, дъра бъра сто чадъра Имало едно време, дъра бъра сто чадъра" в полето за търсене
    And натиска бутона за търсене
    Then Вижда съобщение "Не може да въведете повече от 50 символа"